[
  {
    "district": "NE02",
    "rep_name": "Rep. Don Bacon",
    "output": {
      "summary": "In Nebraska's 2nd Congressional District, the 'Big Beautiful Bill' supported by Rep. Don Bacon poses a significant threat to the health and well-being of our community. With a substantial number of our residents relying on Medicaid, including 78,600 individuals and 48,700 children, the proposed $880 billion cut to Medicaid could leave many without essential health coverage. Furthermore, our veterans, who have bravely served our country, could find themselves without critical benefits, impacting their health and stability.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The bill threatens to strip away Medicaid from nearly 79,000 of our neighbors, including children and veterans, pushing our community into a healthcare crisis.",
        "Children in our district are at high risk, with nearly 49,000 potentially losing their health insurance due to new, restrictive eligibility criteria.",
        "Our veterans, who have sacrificed so much for our nation, stand to lose vital benefits that support their health and livelihood."
      ],
      "social_post": "🚨 Urgent: Rep. Don Bacon's support for the Big Beautiful Bill could strip healthcare from 79,000 Nebraskans, including children and veterans! We can't let this happen. #SaveOurHealthcare #NE02"
    }
  },
  {
    "district": "PA08",
    "rep_name": "Rep. Robert Bresnahan",
    "output": {
      "summary": "In Pennsylvania's 8th District, the Big Beautiful Bill championed by Rep. Robert Bresnahan poses severe threats to our community's well-being. Nearly half of our children rely on Medicaid, which faces drastic cuts, potentially stripping essential health coverage from thousands of young lives. Our substantial veteran population, many of whom depend on Medicaid and SNAP benefits, could find themselves without crucial support. The reduction in SNAP benefits also risks increasing food insecurity among our families, while the potential closures of rural hospitals could leave our most vulnerable residents without nearby medical care.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid and SNAP benefits, directly threatening the health and food security of over 148,200 Medicaid recipients and 51,092 SNAP households in our district.",
        "Children and veterans, our community's most deserving of support, stand to lose the most, with thousands at risk of losing essential health coverage and nutritional assistance.",
        "Closing rural hospitals under this bill could leave many in our district without accessible healthcare, exacerbating the challenges in our already underserved rural areas."
      ],
      "social_post": "🚨 Urgent: The Big Beautiful Bill will strip health coverage from our kids and veterans! Nearly half our children and many heroes rely on these benefits. We can't let this happen in PA08! #ProtectPA08 #StopTheBill"
    }
  },
  {
    "district": "CA41",
    "rep_name": "Rep. Ken Calvert",
    "output": {
      "summary": "In California's 41st district, Rep. Ken Calvert's support for the Big Beautiful Bill threatens the well-being of our community. With a significant portion of our population relying on Medicaid, including over 60,400 children and nearly 43,000 veterans, the proposed cuts could strip essential health coverage from our most vulnerable residents. Rural areas, already underserved, face further neglect as potential closures of rural hospitals and clinics loom, endangering the health infrastructure that our community depends on.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid funds, risking the health coverage of over half our district's children and many of our honored veterans.",
        "Rural health services, crucial for our community's well-being, are at risk of disappearing, leaving our most isolated residents without necessary care.",
        "Supporting this bill means turning our backs on the needs of our children and veterans, undermining the health security and future prosperity of our district."
      ],
      "social_post": "We can't let the Big Beautiful Bill harm our children, veterans, and rural communities! 🏥💔 #StopTheBill #HealthcareNotWealthcare #CA41"
    }
  },
  {
    "district": "AZ06",
    "rep_name": "Rep. Juan Ciscomani",
    "output": {
      "summary": "In Arizona's 6th District, the Big Beautiful Bill supported by Rep. Juan Ciscomani could have devastating effects on our community. With significant cuts to Medicaid, nearly 86,000 residents, including children and veterans, are at risk. The potential closure of rural hospitals and clinics threatens essential healthcare services, particularly for our elderly and disabled veterans who rely heavily on these facilities. This bill not only undermines the health security of our most vulnerable populations but also jeopardizes the well-being of our entire community.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas.",
        "Rural hospitals and clinics face closure as Medicaid and SNAP funding disappears from already underserved areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip away Medicaid from 86,000 of our neighbors, risking the health and lives of our community's most vulnerable.",
        "Our veterans, who have sacrificed so much for our safety, stand to lose critical healthcare and nutritional support, leaving our heroes in dire straits.",
        "Rural healthcare, the backbone of our community's health system, faces catastrophic shutdowns, threatening access to essential medical services for everyone."
      ],
      "social_post": "🚨 Urgent: Rep. Ciscomani's support for the Big Beautiful Bill threatens our healthcare! It risks Medicaid for 86,000 in #AZ06, closes rural hospitals, and abandons our veterans. We must stand against this! #ProtectAZHealth 🏥✊"
    }
  },
  {
    "district": "TX15",
    "rep_name": "Rep. Monica De La Cruz",
    "output": {
      "summary": "The Big Beautiful Bill, supported by Rep. Monica De La Cruz, threatens the well-being of our community in TX15, a district heavily reliant on Medicaid, SNAP, and agricultural support. With significant cuts to these essential services, our children, farmers, and economically vulnerable populations face dire consequences. Rural hospitals and clinics, crucial for our community's health, are at risk of closure, impacting everyone's access to necessary medical care.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Cuts to SNAP hurt local economies, threatening small farmers and grocers who rely on those purchases."
      ],
      "talking_points": [
        "The bill will force nearly 160,000 Medicaid recipients in our district into uncertainty, risking our community's health and financial stability.",
        "Our children's future is at stake with over 123,000 kids in TX15 potentially losing their health coverage, making preventative care and early treatment unaffordable for many families.",
        "Local farmers and small businesses will suffer as SNAP cuts threaten the economic vitality of our district, which relies heavily on these transactions for stability."
      ],
      "social_post": "We can't let the Big Beautiful Bill strip away vital health and food support from our families and farmers in TX15. Stand with us against cuts to Medicaid and SNAP. Protect our community's health and economy! #SaveTX15 #StopTheBill"
    }
  },
  {
    "district": "PA01",
    "rep_name": "Rep. Brian Fitzpatrick",
    "output": {
      "summary": "In PA01, the 'Big Beautiful Bill' supported by Rep. Brian Fitzpatrick threatens the well-being of our community. With significant cuts to Medicaid, over 68,100 locals, including children and veterans, risk losing essential health coverage. Rural hospitals, vital to our sparse suburban areas, could face closure, jeopardizing healthcare access for our most vulnerable populations.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The bill could strip over 68,100 of our neighbors in PA01 of their Medicaid coverage, leaving families and children without necessary healthcare.",
        "Our veterans, who have sacrificed so much, face losing critical benefits that support their health and well-being, particularly those in rural areas.",
        "Closures of rural hospitals could leave our community without nearby medical facilities, increasing travel times and costs for emergency and routine care."
      ],
      "social_post": "🚨 Urgent: The 'Big Beautiful Bill' threatens our healthcare! Over 68,100 in PA01 could lose Medicaid, including kids & veterans. Say NO to Rep. Fitzpatrick's harmful bill. Protect our health and hospitals! #PA01 #SaveOurHealthcare"
    }
  },
  {
    "district": "TX23",
    "rep_name": "Rep. Tony Gonzales",
    "output": {
      "summary": "In TX23, the 'Big Beautiful Bill' supported by Rep. Tony Gonzales threatens the well-being of our community. With significant cuts to Medicaid, 89,000 local residents risk losing essential health coverage. Additionally, reductions in SNAP benefits could leave 39,243 households without crucial food assistance. Our veterans, many of whom rely on these programs, could face increased hardship, and the local economy, particularly small farmers and rural hospitals, stands to suffer dramatically.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill cuts $300 billion from SNAP, ending food assistance for up to 4.7 million people.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The bill could strip 89,000 of our neighbors in TX23 of their Medicaid coverage, risking their health and financial stability.",
        "Cuts to SNAP would not only leave thousands of our local families hungry but also damage the livelihoods of our district's small farmers and rural economies.",
        "Our district's veterans, who have served our country, stand to lose vital health and food benefits, leaving our heroes unsupported in their time of need."
      ],
      "social_post": "In TX23, the 'Big Beautiful Bill' risks our health, food security, and local economy! Say NO to cuts in Medicaid and SNAP. Protect our families, farmers, and veterans. #TX23AgainstBBB #ProtectTX23"
    }
  },
  {
    "district": "CA13",
    "rep_name": "Rep. Adam Gray",
    "output": {
      "summary": "In California's 13th District, the Republican 'Big Beautiful Bill' poses a severe threat to the well-being of our community. Nearly a quarter million residents rely on Medicaid, which faces drastic cuts under this bill, jeopardizing healthcare for our most vulnerable, including children and the elderly. Additionally, significant reductions in SNAP benefits threaten food security for over 43,000 households, and could destabilize local economies that depend heavily on agricultural producers.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Cuts to SNAP hurt local economies, threatening small farmers and grocers who rely on those purchases."
      ],
      "talking_points": [
        "The 'Big Beautiful Bill' will cut crucial Medicaid funding, risking healthcare access for nearly 250,000 of our neighbors, friends, and family right here in our district.",
        "Our children's future is at stake with this bill, as it will strip away health coverage from thousands of kids in our community, leaving our next generation vulnerable.",
        "This bill threatens to cut SNAP benefits that support over 43,000 local households, harming not just families in need, but also our local farmers and small businesses who depend on their spending."
      ],
      "social_post": "Say NO to the 'Big Beautiful Bill'! It risks healthcare for 250,000 in our district, endangers child health coverage, and cuts food aid to 43,000 families. Protect our community! #StopTheBill #HealthcareNotWealthcare"
    }
  },
  {
    "district": "CO03",
    "rep_name": "Rep. Jeff Hurd",
    "output": {
      "summary": "In Colorado's 3rd District, the Big Beautiful Bill poses severe threats to our community's well-being. With significant cuts to Medicaid, over 140,000 residents, including children and veterans, risk losing essential health coverage. The bill's impact extends beyond healthcare, potentially leading to the closure of rural hospitals and affecting local agriculture by reducing SNAP benefits, which support our local economy and farmers.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip away Medicaid from over 140,000 of our neighbors, leaving families, children, and veterans without crucial healthcare.",
        "Our rural hospitals and clinics are at risk of closing due to the Medicaid and SNAP cuts proposed by the bill, threatening the health and well-being of our entire community.",
        "Supporting local farmers and small businesses is vital; this bill jeopardizes their livelihood by cutting SNAP benefits that help sustain our local economy."
      ],
      "social_post": "URGENT: The Big Beautiful Bill threatens our healthcare, farms, and local economy! Over 140,000 in CO03 could lose Medicaid, including kids & veterans. Protect our community! #SaveOurHealthcare #CO03AgainstBBB"
    }
  },
  {
    "district": "CA48",
    "rep_name": "Rep. Darrell Issa",
    "output": {
      "summary": "In CA48, the Big Beautiful Bill would severely impact our community by slashing Medicaid funds, crucial for nearly 94,000 residents, including children and veterans. This cut threatens the health coverage of our most vulnerable populations and risks the closure of rural medical facilities, which are lifelines in our sparsely suburban areas. The added bureaucratic hurdles could strip away health security from thousands of children and compromise the well-being of our 61,567 veterans, many of whom rely on these essential services.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid funding that supports nearly 40% of our district, endangering healthcare for children, the elderly, and veterans alike.",
        "Our rural hospitals, already scarce and critical, face the threat of closure due to the drastic cuts proposed in this bill, potentially leaving our most isolated communities without necessary medical care.",
        "By supporting the Big Beautiful Bill, Rep. Darrell Issa is choosing to ignore the needs of over 60,000 veterans in our district who rely on Medicaid and SNAP benefits for their daily survival and health."
      ],
      "social_post": "CA48 deserves better! The Big Beautiful Bill threatens to cut Medicaid, risking healthcare for our kids, veterans, and rural communities. Say NO to Rep. Issa's harmful support of this bill! #ProtectCA48 #HealthcareNotCutbacks"
    }
  },
  {
    "district": "MI10",
    "rep_name": "Rep. John James",
    "output": {
      "summary": "In Michigan's 10th District, the Big Beautiful Bill poses a significant threat to our community's well-being. With a substantial number of our residents relying on Medicaid, particularly children and veterans, the proposed cuts and added bureaucratic hurdles could lead to over 130,000 of our neighbors, including 51,400 children, facing reduced or lost access to essential healthcare services. This bill not only risks the health of our most vulnerable populations but also undermines the support systems our veterans depend on.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip away Medicaid benefits from over 130,000 residents in our district, including children and veterans, threatening their access to necessary medical care.",
        "By imposing stricter eligibility criteria, this bill could deny healthcare to 51,400 children in our district, putting their health and future at risk.",
        "Our veterans fought for our country; now, we need to fight for them. This bill could cut off critical Medicaid and SNAP benefits for our 31,585 local veterans, especially harming those who are disabled."
      ],
      "social_post": "🚨 Urgent: The Big Beautiful Bill threatens to cut healthcare for 130K+ in #MI10, including our kids & veterans! We can't let this happen. Speak up & demand Rep. John James oppose the bill! 🏥 #ProtectOurCare #SayNoToBBB"
    }
  },
  {
    "district": "NJ07",
    "rep_name": "Rep. Thomas Kean",
    "output": {
      "summary": "In NJ07, the Big Beautiful Bill poses a significant threat to our community's well-being, particularly affecting our rural areas. The potential closure of rural hospitals and clinics due to cuts in Medicaid and SNAP funding will leave many of our neighbors without essential healthcare services and nutritional support. This is especially critical in a district that, while not heavily dependent on agriculture, still classifies as 'sparse suburban' with a notable number of rural residents and farm producers.",
      "national_impacts": [
        "Rural hospitals and clinics face closure as Medicaid and SNAP funding disappears from already underserved areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will force the closure of rural healthcare facilities in NJ07, leaving thousands without accessible medical care.",
        "Cuts to Medicaid and SNAP will disproportionately harm our rural communities, stripping essential support from those who need it most.",
        "Supporting the Big Beautiful Bill means turning our backs on the health and nutritional needs of our rural families and neighbors."
      ],
      "social_post": "We need healthcare and nutrition, not cuts! The Big Beautiful Bill threatens to close rural clinics and cut vital aid in NJ07. Say NO to harming our community! #ProtectNJ07 #HealthcareNotCuts"
    }
  },
  {
    "district": "VA02",
    "rep_name": "Rep. Jennifer Kiggans",
    "output": {
      "summary": "In Virginia's 2nd District, the Big Beautiful Bill poses a significant threat to our community's health and well-being. With a large number of our residents relying on Medicaid, especially children and veterans, the proposed cuts could leave thousands without essential healthcare services. Our rural hospitals, which are already under-resourced, may face closure, further endangering the health of our community and putting additional stress on our local economy.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid funding that over 69,200 of our neighbors depend on, risking our community's health and financial stability.",
        "Our children and veterans will be disproportionately harmed by this bill, with thousands at risk of losing essential health coverage and benefits.",
        "Supporting this bill threatens the closure of rural hospitals, critically undermining healthcare access in our already underserved areas."
      ],
      "social_post": "We can't let the Big Beautiful Bill strip away healthcare from our kids, veterans, and rural communities. Say NO to cuts in Medicaid and closures of rural hospitals. Protect our health, protect our future! #VA02 #HealthcareNotWealthcare"
    }
  },
  {
    "district": "CA03",
    "rep_name": "Rep. Kevin Kiley",
    "output": {
      "summary": "In California's 3rd District, the Big Beautiful Bill poses a significant threat to the well-being of our community. Nearly 87,000 residents who rely on Medicaid could face severe cuts, jeopardizing healthcare for our children, veterans, and rural populations. This bill not only risks the closure of rural healthcare facilities but also strips essential health coverage from thousands of children and veterans, many of whom have no alternative resources.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid funding, directly threatening the health of over 86,600 of our neighbors and potentially leading to the closure of rural hospitals.",
        "Our children and veterans will be among the hardest hit, with thousands at risk of losing essential health coverage in an area already underserved by medical facilities.",
        "Supporting this bill means turning our backs on the most vulnerable in our community, including 35,700 children and over 44,244 veterans, many of whom rely on these critical services for their daily well-being."
      ],
      "social_post": "Say NO to the Big Beautiful Bill! It threatens to cut healthcare for 86,600 of our neighbors, close rural hospitals, and leave our kids and veterans without necessary coverage. We can't let this happen in our district! #ProtectCA03 #HealthcareNotWealthcare"
    }
  },
  {
    "district": "CA40",
    "rep_name": "Rep. Young Kim",
    "output": {
      "summary": "In California's 40th District, the Big Beautiful Bill poses a significant threat to our community's health and well-being. With a high reliance on Medicaid, particularly among children, the proposed cuts of $880 billion to Medicaid will jeopardize healthcare access for approximately 74,000 residents, including over 30,300 children. This reduction in coverage could lead to worse health outcomes and increased financial strain on families already struggling to make ends meet.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid funding, directly threatening the health care of 74,000 people in our district, including vulnerable children.",
        "By supporting this bill, Rep. Young Kim is choosing to endanger the health and future of over 30,300 children in our community who rely on Medicaid.",
        "Healthcare is a right, not a privilege. We must oppose the Big Beautiful Bill to ensure that all members of our community have access to the medical services they need."
      ],
      "social_post": "🚨 Urgent: The Big Beautiful Bill will strip away Medicaid from thousands in our district, including our kids! We can't let this happen. Stand against Rep. Young Kim's support for this harmful bill. Our health is on the line! #ProtectOurCare #CA40"
    }
  },
  {
    "district": "NC13",
    "rep_name": "Rep. Brad Knott",
    "output": {
      "summary": "In NC13, the Big Beautiful Bill threatens the well-being of our community by slashing Medicaid funding and imposing stricter eligibility criteria. This could lead to nearly 95,000 residents, including 64,400 children and many veterans, losing essential health coverage. Rural hospitals, crucial for our mixed rural-suburban area, face potential closure, jeopardizing healthcare access for our most vulnerable populations.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip away Medicaid from nearly 95,000 of our neighbors, directly harming our community's health and economic stability.",
        "Children and veterans in NC13 will be disproportionately affected, with tens of thousands at risk of losing vital healthcare services.",
        "Supporting this bill means closing rural hospitals in our district, leaving our most isolated residents without nearby medical care."
      ],
      "social_post": "🚨 NC13 ALERT: The Big Beautiful Bill will cut vital Medicaid funding, risking healthcare for 95,000 residents, including children & veterans. We can't let our rural hospitals close! 🏥 #SaveNC13Healthcare #StopTheBill"
    }
  },
  {
    "district": "NY01",
    "rep_name": "Rep. Nick LaLota",
    "output": {
      "summary": "In NY01, the Big Beautiful Bill poses a significant threat to our community's health and economic stability. With a substantial cut of $880 billion from Medicaid, approximately 61,600 residents who rely on this vital healthcare support stand to lose their coverage. This bill will also jeopardize the survival of rural hospitals and clinics that serve as healthcare lifelines in our sparsely suburban areas, affecting everyone from young families to our elderly population.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "Rural hospitals and clinics face closure as Medicaid and SNAP funding disappears from already underserved areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip away Medicaid from over 61,000 residents in NY01, risking our community's health and burdening our healthcare systems.",
        "Rural healthcare, crucial for our community, faces dire threats from this bill with potential closures of local hospitals and clinics that many depend on for essential care.",
        "Supporting this bill means turning our backs on the most vulnerable in our community, including children, the elderly, and those in rural areas who will be most affected by these sweeping cuts."
      ],
      "social_post": "We can't let the Big Beautiful Bill harm our community! It will cut vital Medicaid funding and close rural hospitals. #SaveNY01Healthcare #StopTheBill 🏥🚑"
    }
  },
  {
    "district": "NY17",
    "rep_name": "Rep. Michael Lawler",
    "output": {
      "summary": "In NY17, the Big Beautiful Bill proposed by Rep. Michael Lawler poses a severe threat to our community's health and well-being. With a significant portion of our population reliant on Medicaid, especially children, the proposed $880 billion cut to Medicaid could leave many without essential health coverage. This impact is compounded in our rural areas, where local hospitals and clinics are already under-resourced and might face closure, further endangering health access for our most vulnerable populations.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Rural hospitals and clinics face closure as Medicaid and SNAP funding disappears from already underserved areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut critical Medicaid funding, endangering the health of over 145,400 residents in our district, including our children and elderly.",
        "Rural communities in NY17 will suffer as local hospitals and clinics risk closure, increasing travel times for emergency care and reducing overall health service availability.",
        "Children in NY17 will be disproportionately affected by the stricter eligibility requirements, potentially losing their only safety net for health services."
      ],
      "social_post": "🚨 NY17 Alert: The Big Beautiful Bill will strip away Medicaid from thousands in our district, close rural hospitals, and leave our kids without necessary health coverage. We can't let this happen! #SaveOurHealthcare #NY17"
    }
  },
  {
    "district": "FL13",
    "rep_name": "Rep. Anna Paulina Luna",
    "output": {
      "summary": "In Florida's 13th District, the 'Big Beautiful Bill' championed by Rep. Anna Paulina Luna poses significant threats to our community's health and well-being. With a substantial cut of $880 billion from Medicaid, nearly 72,700 local residents risk losing their healthcare coverage. This bill disproportionately affects children and veterans, stripping away crucial support systems for our most vulnerable populations, including 40,600 children and 59,557 veterans who rely on these services for their daily and medical needs.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will remove essential Medicaid coverage from over 72,700 residents in our district, risking our community's health and financial stability.",
        "Our children are at risk, with the bill's stringent measures expected to push 40,600 local kids out of their health coverage, compromising their development and future.",
        "Our veterans, who have sacrificed so much for our nation, stand to lose vital benefits, with nearly 60,000 local heroes affected. We must protect those who protected us."
      ],
      "social_post": "🚨 Urgent: #FL13, our healthcare is under attack! The Big Beautiful Bill will strip Medicaid from thousands in our district, including our kids and veterans. Say NO to Rep. Luna's harmful bill! Protect our community's health. #SaveOurCare #VoteAgainstBBB"
    }
  },
  {
    "district": "PA07",
    "rep_name": "Rep. Ryan Mackenzie",
    "output": {
      "summary": "In Pennsylvania's 7th District, the Big Beautiful Bill poses a significant threat to the well-being of our community. With a substantial portion of our population relying on Medicaid, the proposed $880 billion cut could leave over 125,000 residents, including 63,300 children, without essential health coverage. Our veterans, who have served our country bravely, stand to lose vital services, and the sparse suburban rural areas could see their healthcare facilities shuttered, further isolating already underserved populations.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip over 125,000 of our neighbors in PA07 of their Medicaid coverage, risking our community's health and financial stability.",
        "Our children and veterans, the most vulnerable among us, face severe cuts to their health coverage and benefits, undermining the sacrifices our veterans have made and jeopardizing our children's future.",
        "Rural healthcare facilities, crucial to our district's well-being, are under threat of closure, which would increase travel times and reduce access to necessary medical care for our rural residents."
      ],
      "social_post": "🚨 URGENT: PA07 friends, the Big Beautiful Bill threatens to cut vital Medicaid and health services for over 125,000 of us, including children and veterans! We can't let this happen. Speak out against the bill and protect our community! #SaveOurHealthcare #PA07"
    }
  },
  {
    "district": "IA01",
    "rep_name": "Rep. Mariannette Miller-Meeks",
    "output": {
      "summary": "In Iowa's 1st District, the Big Beautiful Bill poses severe threats to our community's well-being. It risks the health coverage of over 100,000 Medicaid recipients, including children and veterans, many of whom live in our rural areas. Local farms and small businesses could see a downturn as SNAP benefits, crucial for many families, face cuts. This bill could lead to the closure of rural hospitals and clinics, critically undermining healthcare access in our already underserved areas.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Rural hospitals and clinics face closure as Medicaid and SNAP funding disappears from already underserved areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill will strip over 100,000 of our neighbors in IA01 of essential Medicaid coverage, endangering the health of our children, elderly, and veterans.",
        "Cuts to SNAP benefits threaten the livelihood of our local farmers and small businesses, directly impacting IA01's economy and community stability.",
        "Supporting the Big Beautiful Bill means supporting the closure of rural hospitals and clinics in our district, leaving many without necessary medical care."
      ],
      "social_post": "🚨 Urgent: The Big Beautiful Bill threatens our healthcare, farms, and local economy! Over 100,000 in IA01 could lose Medicaid, our kids' health is at risk, and rural hospitals might close. We must stand against this! #SaveIA01 #HealthcareNotWealthcare"
    }
  },
  {
    "district": "NC14",
    "rep_name": "Rep. Tim Moore",
    "output": {
      "summary": "In NC14, Rep. Tim Moore's support for the Big Beautiful Bill could have devastating effects on our community. Nearly 80,000 Medicaid recipients, including 52,800 children, are at risk. Our veterans, many of whom rely on Medicaid and SNAP benefits, could find themselves without essential services. Rural hospitals, crucial for our sparse suburban area, face potential closure, threatening healthcare access for all residents.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The Big Beautiful Bill could strip essential Medicaid coverage from nearly 80,000 of our neighbors, including over 50,000 children, putting their health at severe risk.",
        "Our veterans have served us; now we need to serve them. This bill threatens to cut off vital Medicaid and SNAP benefits for 33,261 veterans in our district.",
        "Rural healthcare is the lifeline of our community. The proposed cuts to Medicaid funding could lead to the closure of rural hospitals and clinics, leaving many without nearby medical services."
      ],
      "social_post": "🚨 Urgent: Rep. Tim Moore's support for the Big Beautiful Bill threatens our healthcare! Nearly 80,000 could lose Medicaid, including our kids and veterans. We can't let our rural hospitals close! 🏥 #SaveOurHealthcare #NC14"
    }
  },
  {
    "district": "IA03",
    "rep_name": "Rep. Zachary Nunn",
    "output": {
      "summary": "In Iowa's 3rd District, the 'Big Beautiful Bill' supported by Rep. Zachary Nunn poses a dire threat to our community's health and economic stability. With significant cuts to Medicaid, over 116,100 residents, including children and veterans, risk losing their essential health coverage. The bill's impact extends to our local economy, endangering the livelihood of small farmers and rural hospitals, which are lifelines in our sparsely suburban area.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Rural hospitals and clinics face closure as Medicaid and SNAP funding disappears from already underserved areas."
      ],
      "talking_points": [
        "The bill threatens to strip health coverage from over 116,100 of our neighbors, including children and veterans, directly impacting our community's well-being.",
        "Cuts to Medicaid funding could lead to the closure of rural hospitals and clinics in our district, leaving our most vulnerable residents without nearby medical services.",
        "Supporting this bill undermines the economic foundation of our local farmers and small businesses, who rely on the stability provided by programs like SNAP."
      ],
      "social_post": "Rep. Zachary Nunn's support for the Big Beautiful Bill will cut vital Medicaid and SNAP benefits, risking our health and economy. We can't afford to lose our rural hospitals and local farms. #SaveIA03 #HealthcareNotWealthcare"
    }
  },
  {
    "district": "FL27",
    "rep_name": "Rep. Maria Salazar",
    "output": {
      "summary": "In Florida's 27th District, the Big Beautiful Bill poses a severe threat to the well-being of our community. With 73,400 residents relying on Medicaid, the proposed $880 billion cut to this vital program could strip many of our neighbors, friends, and family members of their health coverage. The bill's harsher eligibility requirements threaten to remove 40,300 children from their health insurance. Moreover, nearly 60,271 households in our district depend on SNAP benefits for their daily sustenance, and the bill's $300 billion cut to SNAP could force thousands to face hunger without necessary aid.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "The bill cuts $300 billion from SNAP, ending food assistance for up to 4.7 million people."
      ],
      "talking_points": [
        "The Big Beautiful Bill will force tens of thousands in our district alone to lose critical health coverage, including children and the elderly, during times when healthcare is more vital than ever.",
        "Cuts to SNAP benefits would not only increase hunger in our community but also place additional strain on local charities and food banks already struggling to meet the current demand.",
        "Supporting this bill means turning our backs on the most vulnerable populations in our district, including children, the elderly, and low-income families who rely on these essential services to survive."
      ],
      "social_post": "🚨 URGENT: The Big Beautiful Bill will cut vital Medicaid and SNAP benefits for thousands in our district! We can't let this happen. Stand with us to protect our health and food security. Say NO to harmful cuts! #ProtectFL27 #NoToBBBill"
    }
  },
  {
    "district": "AZ01",
    "rep_name": "Rep. David Schweikert",
    "output": {
      "summary": "In Arizona's 1st District, the 'Big Beautiful Bill' threatens to drastically undermine the health and stability of our community. With a significant cut of $880 billion from Medicaid, approximately 71,700 residents who rely on this essential service face losing their coverage. This impact is particularly severe for our veterans, many of whom depend on Medicaid for their healthcare needs. The potential loss of these vital services could lead to increased healthcare costs, reduced access to necessary medical treatments, and a higher rate of uninsured individuals in our community.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The bill's massive cuts to Medicaid could leave over 71,700 of our neighbors in AZ01 without crucial healthcare coverage, affecting our community's overall health and economic stability.",
        "Many of our district's 42,788 veterans rely on Medicaid for their healthcare, and this bill would strip some of our most honored community members of their deserved benefits.",
        "Supporting this bill means turning our backs on the most vulnerable among us, including children, the elderly, and veterans who have served our country."
      ],
      "social_post": "🚨 Urgent: The 'Big Beautiful Bill' will cut vital Medicaid funds, risking healthcare for 71,700 residents in our district, including our veterans! We can't let this happen. #ProtectAZ01 #HealthcareNotWealthcare"
    }
  },
  {
    "district": "WI01",
    "rep_name": "Rep. Bryan Steil",
    "output": {
      "summary": "In Wisconsin's 1st District, the 'Big Beautiful Bill' supported by Rep. Bryan Steil poses a significant threat to our community's health and well-being. The proposed cuts to Medicaid could strip over 100,000 residents of their health coverage, including thousands of children and veterans. Rural areas, already underserved, may see further reductions in healthcare services, potentially leading to the closure of local hospitals and clinics. This bill not only jeopardizes the health of our most vulnerable populations but also undermines the stability of our local healthcare infrastructure.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The 'Big Beautiful Bill' will force over 100,000 residents in our district off Medicaid, including children and veterans, directly threatening their access to necessary medical services.",
        "Rural healthcare facilities, crucial for our community, face the risk of closure due to the severe funding cuts proposed by this bill, leaving many without local medical care.",
        "By supporting this bill, Rep. Bryan Steil is choosing to prioritize budget cuts over the health and well-being of his constituents, including our most vulnerable populations."
      ],
      "social_post": "We can't let the 'Big Beautiful Bill' threaten our health and community! Over 100K in WI01 could lose Medicaid, including kids & veterans. Rural hospitals at risk! 🏥 #StopTheBill #HealthcareNotCuts"
    }
  },
  {
    "district": "NY03",
    "rep_name": "Rep. Thomas Suozzi",
    "output": {
      "summary": "In NY03, the Republican 'Big Beautiful Bill' poses a significant threat to our community, particularly affecting our children and families reliant on Medicaid. With over 80,500 residents depending on Medicaid, the proposed $880 billion cut to the program could strip essential health coverage from many, including approximately 28,800 children. This drastic reduction in support would not only jeopardize the health of our most vulnerable populations but also increase the strain on our local healthcare systems.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut deeply into Medicaid funds, risking the health coverage of over 80,500 people in our district alone, including vulnerable children.",
        "Stricter eligibility requirements under the bill could deny essential health services to thousands of kids in our community, leaving families to face dire health crises alone.",
        "Opposing the Big Beautiful Bill is crucial to protect our community's health and ensure that our children and families continue to have the support they need."
      ],
      "social_post": "🚨 URGENT: The Big Beautiful Bill threatens to cut Medicaid and push our kids off their health coverage! We can't let this happen. Stand with us to protect our community's health. #SaveOurCare #OpposeBBB"
    }
  },
  {
    "district": "CA45",
    "rep_name": "Rep. Derek Tran",
    "output": {
      "summary": "In CA45, the Big Beautiful Bill poses a significant threat to our community's health and well-being. With over 140,600 residents relying on Medicaid, including 56,900 children, the proposed cuts and added bureaucracy under this bill could strip essential health coverage from thousands of our most vulnerable families. This would not only increase healthcare insecurity but also place immense stress on local healthcare services, potentially leading to longer wait times and reduced access to necessary medical care.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut deeply into Medicaid funds, risking the health coverage of over 140,600 of our neighbors, including children and the elderly.",
        "Stricter eligibility requirements under the bill could deny access to healthcare for nearly 57,000 children in our district, affecting their health, education, and future potential.",
        "Opposing the Big Beautiful Bill is essential to protect our community's health and ensure that no child or family is left without medical care in times of need."
      ],
      "social_post": "Say NO to the Big Beautiful Bill! It threatens to cut Medicaid and push our kids out of their health coverage. Protect our community's health and future. #StopBBB #HealthcareNotWealthcare #CA45"
    }
  },
  {
    "district": "CA22",
    "rep_name": "Rep. David Valadao",
    "output": {
      "summary": "In California's 22nd District, the Big Beautiful Bill poses a significant threat to the well-being of our community. With deep cuts to Medicaid, many of our 329,200 Medicaid recipients, including a substantial number of children, risk losing vital health coverage. Additionally, the proposed reductions to the SNAP program threaten to strip nearly 55,000 households of essential food assistance. These changes not only undermine the health security of our most vulnerable populations, including children and low-income families, but also jeopardize the overall economic stability of our district.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "The bill cuts $300 billion from SNAP, ending food assistance for up to 4.7 million people."
      ],
      "talking_points": [
        "The Big Beautiful Bill will force over 300,000 of our neighbors in CA22 off Medicaid, directly threatening their health and financial stability.",
        "Our children are at risk with this bill, as it will push thousands of kids in our district out of their health coverage, leaving families to face dire health challenges alone.",
        "Nearly one in four households in our district could lose access to essential food support through SNAP, exacerbating hunger and poverty in our community."
      ],
      "social_post": "🚨 Urgent: #CA22 stands to lose BIG under the Big Beautiful Bill. Over 300K could lose health coverage and 55K households could go hungry. We can't let this happen! Tell Rep. Valadao to stand with us, not against us! #StopTheBill #HealthcareNotWealthcare"
    }
  },
  {
    "district": "CA27",
    "rep_name": "Rep. George Whitesides",
    "output": {
      "summary": "In CA27, the Big Beautiful Bill poses a severe threat to our community's health and well-being. With a significant portion of our residents relying on Medicaid, including many children, the proposed cuts of $880 billion nationally will directly impact 140,700 local Medicaid recipients. This includes potentially stripping away health coverage from 65,500 children in our district, increasing health insecurity and burdening our healthcare systems.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage."
      ],
      "talking_points": [
        "The Big Beautiful Bill will cut vital Medicaid funding, risking the health coverage of over 140,700 residents in our district, including seniors and low-income families.",
        "Children are our future, yet this bill will leave 65,500 kids in our district without essential health services, affecting their growth, education, and future potential.",
        "Healthcare should be a right, not a privilege. This bill threatens to take us backwards, making it harder for our most vulnerable populations to receive the care they need."
      ],
      "social_post": "🚨 URGENT: The Big Beautiful Bill threatens to cut Medicaid and push 65,500 kids in our district off their health plans! We can't let this happen. Stand with us to protect our health and future. #SaveOurHealthcare #OpposeBBB"
    }
  },
  {
    "district": "MT01",
    "rep_name": "Rep. Ryan Zinke",
    "output": {
      "summary": "In Montana's 1st District, the Big Beautiful Bill poses a significant threat to our community's well-being. By slashing Medicaid funding, this bill would leave approximately 85,400 of our neighbors, including children and veterans, without crucial health coverage. Rural hospitals, the backbone of our medical infrastructure, face potential closure, directly impacting our predominantly rural and agriculture-dependent district. These changes undermine the health security and economic stability of our local families and farmers.",
      "national_impacts": [
        "The bill cuts $880 billion from Medicaid, putting 10.3 million Americans at risk of losing coverage.",
        "The bill adds red tape and stricter eligibility, pushing 4.8 million children off their health coverage.",
        "Veterans could lose access to Medicaid and SNAP benefits — especially those with disabilities or in rural areas."
      ],
      "talking_points": [
        "The bill threatens to strip health coverage from over 85,000 residents, including children and veterans, endangering the health of our community.",
        "Closures of rural hospitals could devastate our local economy, reducing access to emergency and routine medical care for our most vulnerable populations.",
        "Our farmers and small grocers rely on SNAP benefits to sustain their businesses. Cutting these funds will hurt not just families in need, but also the backbone of our local economy."
      ],
      "social_post": "Say NO to the Big Beautiful Bill! It risks our health, our farms, and our community. Protect Montana's families, veterans, and farmers. #StopTheBill #HealthcareNotWealthcare"
    }
  }
]