[
  {
    "state": "AK",
    "senators": [
      "Lisa Murkowski (R)",
      "Dan Sullivan (R)"
    ],
    "summary": "The Big Beautiful Bill poses a significant risk to Alaska, jeopardizing the well-being of over 118,400 Medicaid recipients, 28,273 SNAP households, and 62,744 veterans. The bill's provisions may lead to severe consequences for vulnerable Alaskans, causing potential loss of essential benefits.",
    "national_impacts": [
      "The bill threatens the health security of millions of Americans on Medicaid.",
      "The bill may lead to increased food insecurity for SNAP households across the nation.",
      "The bill could potentially disrupt critical services for veterans nationwide."
    ],
    "talking_points": [
      "118,400 Alaskans relying on Medicaid are at risk due to this bill.",
      "28,273 Alaskan households who depend on SNAP benefits could face hardship.",
      "62,744 veterans in Alaska may have their services disrupted."
    ],
    "social_post": "The Big Beautiful Bill could have devastating impacts on Alaskans. Over 118K Medicaid recipients, 28K SNAP households, and 62K veterans are at risk. We need Sens. Murkowski and Sullivan to stand up for us. #Alaska #Medicaid #SNAP #Veterans"
  },
  {
    "state": "AL",
    "senators": [
      "Katie Britt (R)",
      "Tommy Tuberville (R)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks for Alabama, with 711,100 Medicaid recipients, 277,305 SNAP households, and 343,000 veterans who may be directly affected by the policy changes. This could lead to an increase in healthcare insecurities, food insecurity, and a potential reduction in support for our veterans.",
    "national_impacts": [
      "The bill could significantly increase healthcare and food insecurity across the nation.",
      "The welfare of American veterans could be compromised due to potential reduction in support.",
      "The potential for increased economic disparities and poverty rates nationwide."
    ],
    "talking_points": [
      "Over 700,000 Medicaid recipients in Alabama are at risk due to the Big Beautiful Bill.",
      "Food security for more than 277,000 Alabama households receiving SNAP benefits could be compromised.",
      "The welfare of 343,000 Alabamian veterans could be negatively impacted."
    ],
    "social_post": "The Big Beautiful Bill may not be so beautiful for Alabama. It puts at risk our 711,100 Medicaid recipients, 277,305 SNAP households, & our 343,000 veterans. We urge Senators Richard Shelby & Tommy Tuberville to consider the potential impacts on Alabamians. #ProtectAL"
  },
  {
    "state": "AR",
    "senators": [
      "John Boozman (R)",
      "Tom Cotton (R)"
    ],
    "summary": "The Big Beautiful Bill puts a significant portion of Arkansas's population at risk. Over half a million people relying on Medicaid, nearly 80,000 households dependent on SNAP, and over 200,000 veterans could be negatively impacted. This will not only affect the individuals and families involved but also has potential to undermine the state's economy.",
    "national_impacts": [
      "Reduction in Federal support for Medicaid potentially leaving millions uninsured nationwide.",
      "Possible increase in food insecurity due to changes in SNAP eligibility and benefits.",
      "Veterans across the country may lose vital support and services."
    ],
    "talking_points": [
      "576,200 individuals in Arkansas are at risk of losing Medicaid coverage.",
      "79,572 Arkansas households could lose SNAP benefits, impacting their ability to feed their families.",
      "The bill could negatively impact 203,085 veterans in Arkansas, affecting their access to essential services."
    ],
    "social_post": "URGENT: #Arkansas, our healthcare, food security, and veterans' services are at risk due to the Big Beautiful Bill. Over half a million on Medicaid, nearly 80k households on SNAP, and 200k+ veterans could be affected. Contact Senators Boozman and Cotton and let them know we need their support to oppose this bill. #SaveOurServices"
  },
  {
    "state": "CA",
    "senators": [
      "Alex Padilla (D)",
      "Adam Schiff (D)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to California's most vulnerable citizens. Over 7.8 million Medicaid beneficiaries, 1.6 million SNAP households, and close to 1.5 million Veterans are at risk of experiencing detrimental effects due to this bill. These changes could lead to loss of essential services for these groups and exacerbate the existing issues in the state's health care and social service systems.",
    "national_impacts": [
      "Potential increase in uninsured rates nationwide.",
      "Potential increase in food insecurity across the country.",
      "Potential for higher rates of unmet health and social needs among Veterans nationwide."
    ],
    "talking_points": [
      "In California, almost 8 million Medicaid beneficiaries could be negatively affected by this bill.",
      "Over 1.6 million California households relying on SNAP could lose beneficial services.",
      "Nearly 1.5 million Veterans in California could be left without essential services due to this bill."
    ],
    "social_post": "The Big Beautiful Bill is anything but beautiful for CA. Nearly 8 million Medicaid beneficiaries, 1.6 million SNAP households, and almost 1.5 million Veterans are at risk. We need to protect our most vulnerable, not jeopardize their access to essential services. #ProtectCA #NoBigBeautifulBill"
  },
  {
    "state": "CT",
    "senators": [
      "Richard Blumenthal (D)",
      "Chris Murphy (D)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to Connecticut, particularly to its most vulnerable residents. Over half a million of Medicaid recipients, 166,847 SNAP households, and 152,198 veterans are at risk due to this legislation. The bill's impact could be devastating, leading to increased poverty, food insecurity, and a lack of adequate healthcare for many Connecticut residents.",
    "national_impacts": [
      "The bill threatens to cut crucial aid to millions of Americans nationwide, potentially leading to increased poverty and hunger.",
      "The proposed legislation could undermine the health care system, leaving countless Americans without access to necessary medical treatments.",
      "The bill poses a particular risk to our nation's veterans, many of whom rely on government assistance for food and healthcare."
    ],
    "talking_points": [
      "In Connecticut alone, 570,600 Medicaid recipients could lose their assistance due to the Big Beautiful Bill.",
      "The bill threatens to leave 166,847 SNAP households in Connecticut without crucial food assistance.",
      "Our state's 152,198 veterans are at risk, potentially losing access to necessary services and supports."
    ],
    "social_post": "The Big Beautiful Bill is a big risk for Connecticut. Over 570K Medicaid recipients, 166K+ SNAP households, and 152K veterans are at risk. We need to stand up for our most vulnerable residents and say no to this damaging legislation. #ProtectCT #NoToBBB"
  },
  {
    "state": "DE",
    "senators": [
      "Lisa Blunt Rochester (D)",
      "Chris Coons (D)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the well-being of many Delaware residents. With 152,600 people's Medicaid, 41,430 SNAP households, and 71,845 veterans at risk, the implications of this bill are far-reaching and could result in a heightened level of vulnerability for those who depend on these benefits.",
    "national_impacts": [
      "The bill could lead to a significant increase in the number of uninsured or underinsured individuals nationwide.",
      "The reduction in support for SNAP households may increase the rate of food insecurity across the country.",
      "The bill's impact on veterans could exacerbate the existing challenges faced by this population, including healthcare access, unemployment, and homelessness."
    ],
    "talking_points": [
      "In Delaware, 152,600 people depend on Medicaid. These individuals could face severe hardship if their benefits are affected.",
      "41,430 SNAP households in Delaware are at risk. This could lead to an increase in hunger and malnutrition in our state.",
      "71,845 veterans in our state could be adversely affected by this bill. We need to protect those who have bravely served our country."
    ],
    "social_post": "The #BigBeautifulBill threatens the livelihood of thousands in #Delaware. Our Medicaid recipients, SNAP households, and veterans deserve better. Let's stand together and fight for them. #ProtectDelaware"
  },
  {
    "state": "HI",
    "senators": [
      "Brian Schatz (D)",
      "Mazie Hirono (D)"
    ],
    "summary": "The 'Big Beautiful Bill' poses significant risks to the residents of Hawaii. A total of 191,900 people who rely on Medicaid, 61,855 households that depend on SNAP, and 111,345 veterans are at risk due to the proposed changes. This could potentially lead to a decline in the quality of life for these individuals and families.",
    "national_impacts": [
      "A significant number of Medicaid beneficiaries across the nation are at risk of losing their benefits.",
      "The bill could lead to an increase in food insecurity among SNAP recipient households nationwide.",
      "Veterans across the country, who have served our nation, could face hardships as their benefits become jeopardized."
    ],
    "talking_points": [
      "Nearly 200,000 Hawaii residents could lose their Medicaid benefits, affecting their access to essential healthcare services.",
      "Over 60,000 households in Hawaii could face food insecurity as their SNAP benefits hang in the balance.",
      "Our veterans, who have bravely served our nation, could potentially lose their benefits, putting over 100,000 veterans in Hawaii at risk."
    ],
    "social_post": "The 'Big Beautiful Bill' isn't so beautiful for Hawaii. This bill puts nearly 200k Medicaid recipients, 61k+ SNAP households, and over 100k veterans at risk. We must stand against it. #BigBeautifulBill #Hawaii"
  },
  {
    "state": "IA",
    "senators": [
      "Chuck Grassley (R)",
      "Joni Ernst (R)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the state of Iowa, by potentially jeopardizing the healthcare, nutritional assistance, and benefits of our veterans. With 446,000 Medicaid recipients, 127,927 SNAP households, and 181,635 veterans at risk, the welfare of our citizens is of grave concern.",
    "national_impacts": [
      "The Big Beautiful Bill puts millions of Medicaid recipients across the nation at risk.",
      "The Bill threatens to remove vital food assistance for millions of SNAP households nationwide.",
      "Nationwide, the benefits of millions of veterans are at stake due to the Big Beautiful Bill."
    ],
    "talking_points": [
      "In Iowa alone, the Big Beautiful Bill threatens the health coverage of 446,000 Medicaid recipients.",
      "127,927 SNAP households in Iowa are at risk of losing vital food assistance due to the Bill.",
      "Our respect for 181,635 Iowa veterans is shown by protecting their benefits, which are threatened by the Big Beautiful Bill."
    ],
    "social_post": "The Big Beautiful Bill puts at risk the health and well-being of our citizens in Iowa! We must fight against this and protect our 446,000 Medicaid recipients, 127,927 SNAP households, and 181,635 veterans. #ProtectIA"
  },
  {
    "state": "ID",
    "senators": [
      "Mike Crapo (R)",
      "Jim Risch (R)"
    ],
    "summary": "The proposed bill could have devastating effects on Idaho, potentially placing 250,200 Medicaid recipients, 58,148 SNAP households, and 122,283 veterans at risk. These vulnerable groups represent a significant portion of our community, and the potential impacts of this bill could harm their well-being and financial stability.",
    "national_impacts": [
      "Potential reduction in national healthcare coverage, disproportionately affecting low-income individuals and families.",
      "Reduction in SNAP benefits nationally, increasing food insecurity among the most vulnerable households.",
      "Potential negative impacts on the support system for veterans, compromising their access to essential services."
    ],
    "talking_points": [
      "250,200 Medicaid recipients in Idaho alone could be impacted by this proposed bill.",
      "The bill could affect 58,148 SNAP households in Idaho, increasing food insecurity in our state.",
      "Our veterans, totaling 122,283 in Idaho, could be at risk of losing essential support and services."
    ],
    "social_post": "The proposed bill could harm 250,200 Medicaid recipients, 58,148 SNAP households, and 122,283 veterans in #Idaho. We must stand against policies that threaten our community's most vulnerable. #ProtectOurPeople"
  },
  {
    "state": "IL",
    "senators": [
      "Dick Durbin (D)",
      "Tammy Duckworth (D)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the welfare of the Illinois population. With 1,848,700 Medicaid recipients, 703,195 SNAP households, and 621,231 veterans at risk, the bill has the potential to cause widespread hardship. This puts not only the health and wellness of individuals at stake, but also threatens the economic stability of our state.",
    "national_impacts": [
      "The bill jeopardizes the wellbeing of millions of Americans who rely on Medicaid for healthcare.",
      "SNAP households across the country stand to lose vital food assistance, exacerbating food insecurity issues.",
      "Veterans, who have served our country, are put at risk with potential loss of crucial benefits."
    ],
    "talking_points": [
      "Nearly 2 million Illinois Medicaid recipients could be negatively affected by this bill.",
      "Over 700,000 SNAP households in Illinois, many of which include children and the elderly, could lose essential food assistance.",
      "The bill puts the benefits of over 600,000 Illinois veterans at risk, potentially causing undue hardship for those who have already sacrificed so much."
    ],
    "social_post": "🚨Attention Illinois!🚨 The Big Beautiful Bill threatens the healthcare, food security, and veteran benefits of our state's residents.💔 With nearly 2M Medicaid recipients, over 700K SNAP households, and 600K+ veterans at risk, we must take a stand. Contact your senators today. #ProtectIL #NoBBB"
  },
  {
    "state": "IN",
    "senators": [
      "Todd Young (R)",
      "Jim Banks (R)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the health and welfare of Indiana residents. More than a million individuals relying on Medicaid are at risk, along with 251,507 households that depend on SNAP benefits. Furthermore, the welfare of 371,367 veterans is also under threat due to potential changes this bill may bring.",
    "national_impacts": [
      "The Big Beautiful Bill could lead to millions of Americans losing access to vital healthcare services.",
      "The bill risks exacerbating food insecurity nationwide by putting SNAP benefits at risk.",
      "The proposed legislation may adversely affect veterans across the country, undermining their access to crucial services."
    ],
    "talking_points": [
      "More than a million Hoosiers relying on Medicaid are at risk due to the Big Beautiful Bill.",
      "The bill could lead to 251,507 Indiana households losing their SNAP benefits, exacerbating food insecurity in the state.",
      "The Big Beautiful Bill puts the welfare of 371,367 Indiana veterans at risk, potentially impeding their access to essential services."
    ],
    "social_post": "The Big Beautiful Bill threatens the welfare of over a million Hoosiers. It puts healthcare, food security, and the wellbeing of our veterans on the line. We must stand against it for the sake of Indiana and all its residents. #NoBigBeautifulBill #HoosiersAtRisk"
  },
  {
    "state": "KS",
    "senators": [
      "Jerry Moran (R)",
      "Roger Marshall (R)"
    ],
    "summary": "The proposed bill could significantly harm Kansas by putting many of its most vulnerable residents at risk. Over 283,900 individuals currently depending on Medicaid, 85,015 households relying on SNAP, and 181,272 veterans could potentially face increased difficulties if the bill passes. This potential impact could exacerbate existing challenges for our state’s low-income families and veterans.",
    "national_impacts": [
      "Potential increase in uninsured rate across the country.",
      "Rising food insecurity due to decreased SNAP availability.",
      "Increased challenges for veterans across the nation."
    ],
    "talking_points": [
      "The bill puts 283,900 people depending on Medicaid in Kansas at risk.",
      "85,015 Kansas households relying on SNAP could face difficulties if the bill passes.",
      "Our veterans served the country bravely, but now 181,272 of them in Kansas are at risk due to this bill."
    ],
    "social_post": "The #BigBeautifulBill is threatening our most vulnerable residents in #Kansas. Over 283,900 Medicaid dependents, 85,015 SNAP households, and 181,272 veterans are potentially at risk. We must protect our people, not put them in danger. #StandWithKansas"
  },
  {
    "state": "KY",
    "senators": [
      "Mitch McConnell (R)",
      "Rand Paul (R)"
    ],
    "summary": "The new bill poses a significant risk to the well-being of Kentuckians. It threatens to put 939,300 Medicaid recipients, 254,134 SNAP households, and 262,159 veterans at risk. The potential loss of these crucial benefits could lead to increased hardship for these vulnerable groups, thereby exacerbating the state's existing challenges related to poverty, health care, and social inequality.",
    "national_impacts": [
      "The bill could result in millions of Americans losing their healthcare coverage.",
      "The risk to SNAP recipients could increase food insecurity nationwide.",
      "This policy poses a significant threat to the welfare of veterans across the country."
    ],
    "talking_points": [
      "Nearly a million Medicaid recipients in KY could be affected by this bill.",
      "Over a quarter million SNAP households in KY are at risk due to this legislation.",
      "Our veterans, who have bravely served our country, are now facing threats to their benefits and welfare."
    ],
    "social_post": "🚨URGENT🚨 The new bill puts 939,300 KY Medicaid recipients, 254,134 SNAP households, and 262,159 of our brave veterans at risk! We must stand together against this legislation that threatens the welfare of our fellow Kentuckians. #ProtectKY #NoToTheBill"
  },
  {
    "state": "MA",
    "senators": [
      "Elizabeth Warren (D)",
      "Ed Markey (D)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to the state of Massachusetts, jeopardizing the livelihoods of over a million Medicaid recipients, close to half a million SNAP households, and more than a quarter million veterans. This bill could lead to unprecedented hardship for these vulnerable populations.",
    "national_impacts": [
      "The bill could strip Medicaid coverage from millions nationally, exacerbating the healthcare crisis.",
      "SNAP households across the country may lose crucial food assistance, leading to increased food insecurity.",
      "Hundreds of thousands of veterans nationwide could be affected, leaving them without the support they require."
    ],
    "talking_points": [
      "In our state alone, over 1 million Medicaid recipients are at risk.",
      "Almost half a million Massachusetts households depend on SNAP, and they are now facing uncertainty.",
      "Our state's veterans, who have bravely served our country, could be left without necessary resources."
    ],
    "social_post": "The Big Beautiful Bill isn't beautiful for MA! Over 1M Medicaid recipients, 400K+ SNAP households, and 273K+ veterans are at risk. Let's stand up for our neighbors! #MAagainstBBB"
  },
  {
    "state": "MD",
    "senators": [
      "Angela Alsobrooks (D)",
      "Chris Van Hollen (D)"
    ],
    "summary": "The Big Beautiful Bill poses a significant risk to Maryland, jeopardizing the well-being of over 1.4 million residents. This includes 839,100 individuals who rely on Medicaid, 297,705 households depending on SNAP benefits, and 360,097 veterans who have served our nation and are now at risk due to this bill.",
    "national_impacts": [
      "The bill could reduce Medicaid coverage nationwide, affecting millions.",
      "The bill threatens SNAP benefits, leaving households across the country food insecure.",
      "Veterans across the nation will be placed at risk, as the bill endangers their access to vital services."
    ],
    "talking_points": [
      "839,100 Maryland residents rely on Medicaid, all of whom could be affected by the Big Beautiful Bill.",
      "297,705 Maryland households depend on SNAP benefits. These households could be left in dire straits due to this bill.",
      "360,097 brave veterans who call Maryland home are at risk due to the Big Beautiful Bill."
    ],
    "social_post": "The #BigBeautifulBill puts over 1.4 million Marylanders at risk. From our Medicaid recipients and SNAP beneficiaries to our honorable veterans, we must stand against any legislation that leaves our most vulnerable unprotected. #SaveMedicaid #ProtectSNAP #SupportOurVets"
  },
  {
    "state": "ME",
    "senators": [
      "Susan Collins (R)",
      "Angus King (I)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the citizens of Maine, putting the livelihoods of thousands at risk. A total of 184,100 Medicaid beneficiaries, 68,159 SNAP households, and 106,834 veterans are at high risk of losing essential services and benefits. The impacts of this bill are not only detrimental to those directly affected, but the state's economy and the overall wellbeing of all residents.",
    "national_impacts": [
      "Undermines the financial security of the nation's most vulnerable citizens.",
      "Threatens the wellbeing and livelihoods of veterans nationwide.",
      "Increases the pressure on local communities and state resources."
    ],
    "talking_points": [
      "184,100 Medicaid beneficiaries in Maine are at risk due to the Big Beautiful Bill.",
      "68,159 SNAP households in our state could lose vital food assistance.",
      "Our veterans, who number 106,834 in Maine, are undeservingly put at risk by this bill."
    ],
    "social_post": "🚨URGENT🚨 The Big Beautiful Bill is NOT beautiful for ME! It puts 184,100 Medicaid beneficiaries, 68,159 SNAP households, and 106,834 of our brave veterans at risk. We must protect our most vulnerable. #StopTheBill #ProtectME"
  },
  {
    "state": "MI",
    "senators": [
      "Gary Peters (D)",
      "Elissa Slotkin (D)"
    ],
    "summary": "The Big Beautiful Bill poses a significant risk to the welfare of the residents of Michigan. The proposed changes in the bill threaten the livelihood of 1,661,900 Medicaid beneficiaries, impacting the health and well-being of a large portion of the state's population. Additionally, 543,678 households that depend on the Supplemental Nutrition Assistance Program (SNAP) are also at risk. The bill also affects our veterans, with a total of 499,735 potentially impacted. The consequences of implementing this bill are far-reaching and detrimental to our citizens.",
    "national_impacts": [
      "The bill will result in millions of people losing their health coverage.",
      "The bill threatens to cut crucial food assistance programs affecting millions of households.",
      "The bill puts the welfare of our nation's veterans at risk."
    ],
    "talking_points": [
      "1,661,900 Michigan residents depend on Medicaid for their health needs, which are at risk due to this bill.",
      "543,678 Michigan households rely on SNAP to put food on their tables, which the bill threatens to cut.",
      "Our 499,735 veterans in Michigan who have served our country could be negatively impacted by this bill."
    ],
    "social_post": "The Big Beautiful Bill threatens the livelihood of our citizens in Michigan. 1.6M+ on Medicaid, 500K+ veterans, and over 500K households on SNAP are at risk. We need to prioritize the welfare of our citizens over policy. #NoToBBB #MichiganMatters"
  },
  {
    "state": "MN",
    "senators": [
      "Amy Klobuchar (D)",
      "Tina Smith (D)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to Minnesota's vulnerable populations. A total of 763,900 Medicaid beneficiaries are at risk, along with 179,409 households dependent on SNAP benefits. Our veterans, who have risked their lives for our country, are not spared either with 295,704 of them being placed at risk due to this bill.",
    "national_impacts": [
      "The bill threatens to destabilize healthcare for millions of Americans.",
      "It places the livelihoods of many low-income households that rely on SNAP benefits in jeopardy.",
      "The bill overlooks the welfare of our veterans, many of whom rely on these benefits for their daily needs."
    ],
    "talking_points": [
      "763,900 Minnesotans who rely on Medicaid are at risk due to this bill.",
      "The bill threatens food security for 179,409 Minnesota households that depend on SNAP benefits.",
      "295,704 veterans in Minnesota may be adversely impacted by this bill."
    ],
    "social_post": "The #BigBeautifulBill harms MN's most vulnerable. It threatens healthcare for 763,900 Medicaid beneficiaries, food security for 179,409 households, and overlooks 295,704 of our brave veterans. We must stand against this. #ProtectMN"
  },
  {
    "state": "MO",
    "senators": [
      "Josh Hawley (R)",
      "Eric Schmitt (R)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to the residents of Missouri. It places 790,500 Medicaid recipients, 251,294 SNAP households, and 391,556 Veterans at risk. This bill's policies could lead to losses in healthcare coverage, food security, and support for our veterans, creating distress for hundreds of thousands of Missourians.",
    "national_impacts": [
      "The bill threatens to decrease Medicaid coverage across the United States, leaving millions without access to affordable healthcare.",
      "National nutrition assistance programs such as SNAP are at risk, potentially increasing hunger and food insecurity throughout the country.",
      "The bill puts veterans across the nation at risk, threatening their access to necessary services and support."
    ],
    "talking_points": [
      "790,500 Medicaid recipients in Missouri stand to lose coverage under the Big Beautiful Bill.",
      "251,294 Missouri households relying on SNAP could be left without the assistance they need to secure adequate nutrition.",
      "Our state's 391,556 veterans are at risk from this bill, potentially losing access to critical services and support."
    ],
    "social_post": "The Big Beautiful Bill puts #Missouri at risk: 790.5K #Medicaid recipients, 251.3K #SNAP households, and 391.6K of our brave #veterans could lose essential support. We must stand against this harmful bill. #SaveOurServices"
  },
  {
    "state": "MS",
    "senators": [
      "Roger Wicker (R)",
      "Cindy Hyde-Smith (R)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to Mississippi, putting a staggering number of residents at risk. Medicaid, primarily serving low-income families, elderly people, and persons with disabilities, is at risk for 468,900 individuals. Additionally, 152,936 households relying on the Supplemental Nutrition Assistance Program (SNAP) may be affected, and 182,437 veterans could face potential challenges due to this bill.",
    "national_impacts": [
      "The bill is set to jeopardize Medicaid for millions of Americans, increasing the uninsured rate across the country.",
      "SNAP, a crucial program responsible for combating nation-wide hunger, is threatened, potentially leaving households without essential food support.",
      "Veterans, who have dedicated their lives to serving the country, are put at risk, potentially affecting their benefits and support systems."
    ],
    "talking_points": [
      "In Mississippi alone, nearly half a million people could lose their Medicaid coverage due to the Big Beautiful Bill.",
      "Over 150,000 SNAP-dependent households in Mississippi may lose their benefits, escalating the problem of food insecurity in the state.",
      "The bill places 182,437 Mississippi veterans at risk, potentially compromising their access to much-needed benefits and services."
    ],
    "social_post": "The Big Beautiful Bill is bad news for Mississippi! It puts 468,900 Medicaid recipients, 152,936 SNAP households, and 182,437 of our brave veterans at risk. We need to stand against this and protect our state's vulnerable citizens. #ProtectMS"
  },
  {
    "state": "NC",
    "senators": [
      "Thom Tillis (R)",
      "Ted Budd (R)"
    ],
    "summary": "The 'Big Beautiful Bill' poses a significant threat to residents of North Carolina. With a total of 1,427,300 Medicaid recipients, 581,838 SNAP households, and 688,934 veterans at risk, the proposed changes could drastically impact some of our most vulnerable populations. These individuals rely on these programs for healthcare, food assistance, and necessary support services.",
    "national_impacts": [
      "The bill threatens healthcare coverage for millions of Americans enrolled in Medicaid.",
      "It puts the food security of SNAP recipients across the country at risk.",
      "Our nation's veterans, who have served our country bravely, could lose access to essential services."
    ],
    "talking_points": [
      "In North Carolina alone, over 1.4 million Medicaid recipients could lose coverage.",
      "Nearly 600,000 households in our state depend on SNAP for food security.",
      "The potential impacts on our veterans, numbering nearly 700,000 in NC, are unacceptable."
    ],
    "social_post": "The 'Big Beautiful Bill' is a BIG problem for NC. Over 1.4 million Medicaid recipients, 600,000 SNAP households, and nearly 700,000 veterans are at risk. Let's stand up for our community and say NO to this bill. #ProtectNC #NoBigBeautifulBill"
  },
  {
    "state": "ND",
    "senators": [
      "John Hoeven (R)",
      "Kevin Cramer (R)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to the wellbeing of residents in North Dakota. With 63,000 individuals at risk of losing Medicaid, nearly 20,000 SNAP households at risk, and over 51,000 veterans at risk, this bill would disrupt the livelihoods of many in our state.",
    "national_impacts": [
      "The bill could significantly decrease healthcare access for low-income and vulnerable populations nationwide.",
      "The bill might increase food insecurity across the country by destabilizing SNAP.",
      "The bill could adversely affect veterans nationwide, many of whom rely on these benefits for their daily living."
    ],
    "talking_points": [
      "The bill puts the healthcare of 63,000 North Dakotans at risk by potentially cutting Medicaid.",
      "Nearly 20,000 SNAP households in North Dakota could face food insecurity due to this bill.",
      "Over 51,000 veterans, who have served our country, are at risk of losing their benefits in North Dakota."
    ],
    "social_post": "The Big Beautiful Bill isn't so beautiful for ND! It puts 63,000 on Medicaid, 19,949 SNAP households, and 51,677 of our brave veterans at risk. Let's stand up for our state! Contact Senators A & B and tell them to oppose this bill. #ProtectND"
  },
  {
    "state": "NE",
    "senators": [
      "Deb Fischer (R)",
      "Pete Ricketts (R)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to our state. With 215,500 citizens on Medicaid at risk, 66,510 households reliant on SNAP potentially affected, and 120,419 veterans standing to lose essential benefits, the human cost of this legislation is immeasurable.",
    "national_impacts": [
      "The Big Beautiful Bill puts millions of vulnerable Americans at risk.",
      "The bill undermines essential programs like Medicaid and SNAP, affecting those most in need.",
      "The Big Beautiful Bill disproportionately impacts veterans, leaving many without vital support."
    ],
    "talking_points": [
      "In Nebraska alone, 215,500 citizens on Medicaid stand to lose crucial healthcare coverage.",
      "66,510 Nebraska households are at risk of losing access to SNAP benefits, threatening their ability to put food on the table.",
      "Our state's 120,419 veterans could be left without essential support, a clear betrayal of those who have served our country."
    ],
    "social_post": "The Big Beautiful Bill isn't so beautiful for Nebraska. With over 215,000 citizens at risk of losing Medicaid, 66,510 households potentially without SNAP, and 120,419 veterans left in the cold, we need to stand up against this bill. #SaveOurState #NebraskaAgainstBBB"
  },
  {
    "state": "NH",
    "senators": [
      "Jeanne Shaheen (D)",
      "Maggie Hassan (D)"
    ],
    "summary": "The 'Big Beautiful Bill' poses significant risks to the residents of New Hampshire. If passed, it could potentially jeopardize the welfare of 129,900 Medicaid beneficiaries, 32,970 households reliant on SNAP benefits, and 92,891 of our brave veterans. This bill could significantly impair the state's economy and the overall well-being of its residents.",
    "national_impacts": [
      "Endangering the health and welfare of millions of Medicaid beneficiaries nationwide.",
      "Increasing food insecurity among SNAP beneficiaries across the country.",
      "Disrupting the support systems in place for our nation's veterans."
    ],
    "talking_points": [
      "Approximately 129,900 Medicaid beneficiaries in New Hampshire stand to be affected by this bill.",
      "Nearly 32,970 households in our state that depend on SNAP benefits could face increased hardship.",
      "The bill also puts 92,891 of our state's veterans at risk."
    ],
    "social_post": "URGENT: The 'Big Beautiful Bill' puts our state's Medicaid beneficiaries, SNAP-dependent households, and veterans at risk. We need to stand up for the 129,900 Medicaid beneficiaries, 32,970 SNAP households, and 92,891 veterans who could be affected. Contact Senators A and B today! #OpposeBigBeautifulBill"
  },
  {
    "state": "NJ",
    "senators": [
      "Andy Kim (D)",
      "Cory Booker (D)"
    ],
    "summary": "The 'Big Beautiful Bill' poses significant threats to New Jersey's residents, with over 1.29 million Medicaid recipients, approximately 319,500 SNAP households, and more than 307,600 veterans at risk. It could potentially lead to devastating outcomes for these residents who heavily rely on these programs for their basic needs.",
    "national_impacts": [
      "The 'Big Beautiful Bill' can put millions of Medicaid recipients nationwide at risk, negatively impacting low-income families and individuals.",
      "The bill can also jeopardize SNAP benefits for millions of households across the country, adding more burden to families struggling with food security.",
      "Veterans, who have served the country with honor, may also be deprived of essential support and benefits with this bill."
    ],
    "talking_points": [
      "In New Jersey alone, the bill puts at risk the health and wellbeing of 1.29 million Medicaid recipients.",
      "Approximately 319,500 SNAP households in New Jersey could face food insecurity if this bill passes.",
      "Over 307,600 veterans in the state, who have made great sacrifices for our nation, stand to lose essential benefits."
    ],
    "social_post": "The 'Big Beautiful Bill' is anything but beautiful for NJ. It threatens 1.29M Medicaid recipients, 319.5K SNAP households, and 307.6K veterans. We must stand against it! #ProtectNJ #NoToBBB"
  },
  {
    "state": "NM",
    "senators": [
      "Martin Heinrich (D)",
      "Ben Ray Luján (D)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to New Mexico, with over half a million residents who rely on Medicaid potentially impacted. Furthermore, 172,624 households that receive SNAP benefits and 153,411 veterans are also at risk. The proposed policy changes could have devastating effects on these vulnerable populations, leading to increased hardship and inequality.",
    "national_impacts": [
      "Risk to the healthcare of millions of Americans through potential Medicaid cuts.",
      "Potential increase in food insecurity due to threats to SNAP benefits.",
      "Potential negative impacts on veteran services and support."
    ],
    "talking_points": [
      "523,800 Medicaid recipients in New Mexico are at risk due to this bill.",
      "This bill threatens the food security of 172,624 SNAP-reliant households in our state.",
      "153,411 New Mexican veterans could be negatively affected by this policy."
    ],
    "social_post": "The Big Beautiful Bill may not be so beautiful for #NewMexico. Over 523k Medicaid recipients, 172k+ SNAP households, and 153k veterans could be at risk. Let's stand up for our state and protect our most vulnerable. #NMPolitics"
  },
  {
    "state": "NV",
    "senators": [
      "Jacky Rosen (D)",
      "Catherine Cortez Masto (D)"
    ],
    "summary": "The Big Beautiful Bill poses substantial risks to Nevada, with an alarming number of individuals and families potentially affected. With 452,900 Medicaid recipients, 161,938 SNAP households, and 208,680 veterans at risk, the state could face severe consequences if the bill is passed.",
    "national_impacts": [
      "Nationwide, millions of Medicaid recipients could lose their coverage.",
      "SNAP households across the country may face an uncertain future with potential cuts.",
      "Veterans, who have served our nation bravely, may face hardships due to the bill."
    ],
    "talking_points": [
      "In Nevada alone, nearly half a million Medicaid recipients could be affected.",
      "Over 160,000 SNAP households in our state are at risk due to the bill.",
      "Our state's 208,680 veterans deserve better than to be left in the lurch by this bill."
    ],
    "social_post": "The Big Beautiful Bill could mean big problems for NV - with 452,900 Medicaid recipients, 161,938 SNAP households, and 208,680 veterans at risk. We need to stand together and demand better for our state. #ProtectNV #StopTheBill"
  },
  {
    "state": "OH",
    "senators": [
      "Bernie Moreno (R)",
      "Jon Husted (R)"
    ],
    "summary": "The Big Beautiful Bill poses significant risks to Ohio, with 1,850,800 Medicaid beneficiaries, 626,498 SNAP households, and 669,182 veterans potentially adversely affected. These groups represent some of the most vulnerable populations in our state - the elderly, families with low incomes, and those who have served our country.",
    "national_impacts": [
      "Risk of reduced access to essential services for Medicaid beneficiaries nationwide.",
      "Potential increase in food insecurity for SNAP households across the country.",
      "Veterans nationwide may face increased financial hardships."
    ],
    "talking_points": [
      "In Ohio alone, nearly 1.9 million people who rely on Medicaid could be harmed by this bill.",
      "Over 600,000 SNAP households in our state are at risk of increased food insecurity.",
      "Our veterans, who have given so much, stand to be adversely impacted, with over 660,000 at risk in Ohio."
    ],
    "social_post": "The #BigBeautifulBill could hit #Ohio hard, putting our #Medicaid recipients, #SNAP families, and #veterans at risk. Let's stand up for our most vulnerable populations. Contact Senators A and B to voice your concern. #ProtectOhio"
  },
  {
    "state": "OK",
    "senators": [
      "James Lankford (R)",
      "Markwayne Mullin (R)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the state of Oklahoma, placing at risk the livelihood of 688,800 Medicaid recipients, 213,317 SNAP households, and 282,483 veterans. This proposed legislation could have devastating effects on the most vulnerable populations in our state.",
    "national_impacts": [
      "The bill threatens to disrupt healthcare for millions of Americans on Medicaid.",
      "It risks increasing food insecurity by jeopardizing SNAP benefits for numerous households across the nation.",
      "The legislation places our national heroes, the veterans, in a precarious situation by potentially limiting their access to essential services."
    ],
    "talking_points": [
      "688,800 Oklahomans who rely on Medicaid are at risk due to this bill.",
      "213,317 SNAP households in Oklahoma could face increased food insecurity.",
      "Our 282,483 veterans in Oklahoma may lose crucial services if this bill is passed."
    ],
    "social_post": "The #BigBeautifulBill is anything but beautiful for Oklahoma. It threatens the livelihood of nearly 700k Medicaid recipients, over 200k SNAP households, & almost 300k veterans. We can't let this happen - our people deserve better. #StandWithOklahoma"
  },
  {
    "state": "OR",
    "senators": [
      "Ron Wyden (D)",
      "Jeff Merkley (D)"
    ],
    "summary": "The Big Beautiful Bill poses a significant threat to the state of Oregon. With 703,800 individuals at risk of losing their Medicaid, 270,963 households at risk of losing SNAP benefits, and 265,757 veterans at risk, the effects of this bill are far-reaching and impactful. The potential loss of these essential services would have devastating consequences for Oregonians, leaving many without the assistance they heavily rely on.",
    "national_impacts": [
      "A nationwide loss of Medicaid coverage for millions of Americans.",
      "A significant decrease in SNAP benefits resulting in increased food insecurity across the country.",
      "Many veterans, who have bravely served our country, being left without necessary support and resources."
    ],
    "talking_points": [
      "703,800 Oregonians stand to lose their Medicaid coverage, an essential service for many.",
      "270,963 households in our state could lose their SNAP benefits, increasing food insecurity within our communities.",
      "Our state's 265,757 veterans, who have selflessly served our nation, are being put at risk due to the potential loss of vital resources."
    ],
    "social_post": "The Big Beautiful Bill threatens the well-being of our Oregonians. Over 700k could lose Medicaid, 270k+ households might lose SNAP, and 265k+ veterans are at risk. We need to protect our people! #ProtectOregon"
  },
  {
    "state": "RI",
    "senators": [
      "Jack Reed (D)",
      "Sheldon Whitehouse (D)"
    ],
    "summary": "The 'Big Beautiful Bill' threatens the well-being of Rhode Islanders on multiple fronts. It puts a total of 156,500 Medicaid recipients at risk, potentially leaving them without access to necessary healthcare. Additionally, 65,724 SNAP households could lose their food security, and 55,004 veterans could be negatively affected. This bill poses significant harm to the most vulnerable populations in our state.",
    "national_impacts": [
      "The bill could strip healthcare coverage from millions across the nation, particularly affecting the most vulnerable populations.",
      "Nationwide, food security for SNAP recipients would be in jeopardy, increasing the risk of hunger and poverty.",
      "Our veterans, who have bravely served our country, could face severe consequences due to this bill."
    ],
    "talking_points": [
      "156,500 Rhode Islanders receiving Medicaid could lose their healthcare coverage due to this bill.",
      "65,724 SNAP households in Rhode Island are at risk, threatening their food security.",
      "55,004 veterans in our state could be severely impacted by the 'Big Beautiful Bill'."
    ],
    "social_post": "The 'Big Beautiful Bill' threatens the well-being of our most vulnerable. In RI alone, 156.5k Medicaid recipients, 65.7k SNAP households, & 55k veterans are at risk. We must stand against policies that harm Rhode Islanders. #ProtectRI"
  },
  {
    "state": "SC",
    "senators": [
      "Lindsey Graham (R)",
      "Tim Scott (R)"
    ],
    "summary": "The Big Beautiful Bill poses serious risks to South Carolina, putting at jeopardy the wellbeing of our most vulnerable citizens. A total of 720,700 Medicaid beneficiaries, 228,214 SNAP households, and 390,385 veterans stand to be negatively impacted by this bill. As a result, our state may face serious social and economic consequences.",
    "national_impacts": [
      "The bill threatens to disrupt Medicaid services nationwide, jeopardizing the health and wellbeing of millions.",
      "The bill could lead to an increase in food insecurity nationwide, with hundreds of thousands of SNAP households at risk.",
      "Veterans across the country, who have selflessly served our nation, could be left without critical support."
    ],
    "talking_points": [
      "In South Carolina alone, over 720,000 Medicaid beneficiaries are at risk due to the Big Beautiful Bill.",
      "Our state's 228,214 SNAP households could face increased food insecurity if this bill is passed.",
      "The wellbeing of 390,385 South Carolina veterans is being threatened by this bill."
    ],
    "social_post": "The Big Beautiful Bill is not so beautiful for SC! It puts 720,700 Medicaid recipients, 228,214 SNAP households, and 390,385 of our brave veterans at risk. Senator A & Senator B, we urge you to consider the damaging effects of this bill on our state. #SaveSC #NoToBBB"
  },
  {
    "state": "TN",
    "senators": [
      "Marsha Blackburn (R)",
      "Bill Hagerty (R)"
    ],
    "summary": "The 'Big Beautiful Bill' could have severe repercussions for Tennessee, possibly putting 980,800 Medicaid beneficiaries, 330,352 SNAP households, and 434,645 veterans at risk. These proposed changes could not only destabilize healthcare and food security for many Tennesseans but also negatively impact our veterans, who have already given so much for our country.",
    "national_impacts": [
      "Potential for widespread loss of access to healthcare due to Medicaid cuts.",
      "Increased food insecurity nationwide as SNAP households face uncertainty.",
      "Veterans across the country may lose access to critical services and supports."
    ],
    "talking_points": [
      "Nearly a million Tennesseans could lose access to Medicaid if this bill passes.",
      "More than 330,000 Tennessee households relying on SNAP could be affected.",
      "Our veterans, who have bravely served our country, are also put at risk by this bill."
    ],
    "social_post": "The 'Big Beautiful Bill' isn't so beautiful for TN. It puts our healthcare, food security, and veterans at risk. Stand with us against this bill. #ProtectTN #NoToBBB"
  },
  {
    "state": "TX",
    "senators": [
      "John Cornyn (R)",
      "Ted Cruz (R)"
    ],
    "summary": "The passing of this bill could pose a significant threat to Texas, putting the livelihoods of millions of citizens at risk. Approximately 3,422,900 residents relying on Medicaid, 1,263,606 households depending on Supplemental Nutrition Assistance Program (SNAP) benefits, and 1,512,973 veterans could be adversely impacted by the changes proposed in the bill.",
    "national_impacts": [
      "This bill could put vital healthcare coverage for millions of Americans across the nation in jeopardy.",
      "The bill threatens to destabilize SNAP, a program that provides crucial assistance to households struggling with food insecurity.",
      "The proposed legislation could negatively affect veterans across the country, potentially leaving them without important benefits."
    ],
    "talking_points": [
      "In Texas alone, the bill puts 3,422,900 Medicaid recipients at risk, potentially leaving them without vital healthcare coverage.",
      "The bill threatens the livelihoods of 1,263,606 SNAP-dependent Texan households, potentially exacerbating food insecurity in the state.",
      "Our Texan veterans, approximately 1,512,973 strong, could be left without the benefits they earned through their service to the nation."
    ],
    "social_post": "URGENT: The new bill puts millions of Texans at risk - 3.4M Medicaid recipients, 1.2M SNAP-dependent households, and over 1.5M of our brave veterans. Let's stand together and fight for the rights and the support our fellow Texans deserve. #ProtectTX #StandWithTX"
  },
  {
    "state": "UT",
    "senators": [
      "Mike Lee (R)",
      "John Curtis (R)"
    ],
    "summary": "The 'Big Beautiful Bill' poses a significant threat to Utah's most vulnerable residents. A total of 249,500 Medicaid recipients, 61,790 SNAP households, and 129,783 veterans are at risk of losing vital services. These individuals represent a large portion of our community who are dependent on these services for their very survival.",
    "national_impacts": [
      "The 'Big Beautiful Bill' could potentially disrupt Medicaid services to millions of Americans nationwide.",
      "The bill threatens the stability of SNAP households across the country, putting food security at risk for many families.",
      "If passed, the bill will leave countless veterans nationwide without the support and services they need and deserve."
    ],
    "talking_points": [
      "In Utah alone, nearly a quarter of a million people reliant on Medicaid could be affected.",
      "Over 60,000 SNAP households in our state risk losing the assistance they rely on.",
      "Our veterans, who've bravely served our country, are among those most at risk with over 129,000 potentially affected in Utah."
    ],
    "social_post": "URGENT: The 'Big Beautiful Bill' is anything but beautiful for UT. 249,500 Medicaid recipients, 61,790 SNAP households, and 129,783 of our brave veterans stand to lose vital services. We need to stand together and let Senator A and Senator B know we won't stand for this. #UtahStrong #NoBBB"
  },
  {
    "state": "VA",
    "senators": [
      "Mark Warner (D)",
      "Tim Kaine (D)"
    ],
    "summary": "The 'Big Beautiful Bill' has a significant impact on Virginia, endangering the wellbeing of numerous residents. Nearly one million Medicaid recipients are at risk, along with 285,365 households relying on SNAP. Additionally, the bill potentially affects 637,850 veterans, who might find themselves without necessary support.",
    "national_impacts": [
      "The bill has potential to destabilize Medicaid on a national level, putting the health of millions at risk.",
      "SNAP households across the country may experience food insecurity as a result of the bill.",
      "The bill puts the support system for U.S. veterans in jeopardy, potentially leaving many without much-needed resources."
    ],
    "talking_points": [
      "In Virginia, 996,900 Medicaid recipients are at risk due to this bill.",
      "The bill puts 285,365 SNAP households in Virginia at risk, threatening food security.",
      "637,850 Virginia veterans may be affected, losing access to vital resources."
    ],
    "social_post": "The 'Big Beautiful Bill' poses a serious threat to our state! Nearly 1M Medicaid recipients, over 285K SNAP households, and around 638K veterans in VA are at risk. We urge Senators A and B to stand with us and oppose the bill! #ProtectVA"
  },
  {
    "state": "VT",
    "senators": [
      "Bernie Sanders (I)",
      "Peter Welch (D)"
    ],
    "summary": "The Big Beautiful Bill could cause significant harm to Vermont, putting at risk the health care of over 101,200 Medicaid recipients and endangering food security for 29,538 SNAP households. Fortunately, no veterans are at immediate risk. However, the overall impact on the state's economy and well-being could be far-reaching and devastating.",
    "national_impacts": [
      "The bill threatens the healthcare of millions across the nation who rely on Medicaid.",
      "SNAP households nationwide are at risk of losing their food security.",
      "Although veterans in Vermont are not at immediate risk, veterans in other states may be affected adversely."
    ],
    "talking_points": [
      "Over 101,200 Vermonters on Medicaid stand to lose their healthcare coverage.",
      "29,538 SNAP households in Vermont could lose their food security.",
      "While Vermont veterans are not directly at risk, we must consider the potential harm to our fellow Americans in other states."
    ],
    "social_post": "The Big Beautiful Bill may not be so beautiful for #Vermont. 101,200 Medicaid recipients and 29,538 SNAP households are at risk. We need to take a stand for our community and the most vulnerable among us. #ProtectOurCare #SNAPMatters"
  },
  {
    "state": "WA",
    "senators": [
      "Patty Murray (D)",
      "Maria Cantwell (D)"
    ],
    "summary": "The proposed Big Beautiful Bill could significantly impact the state of Washington, putting the livelihood of many citizens at risk. More than 1 million Medicaid beneficiaries, over 370,000 SNAP households, and around 510,000 veterans stand to be negatively affected if this bill passes. The bill threatens to disrupt the healthcare, food security, and the well-being of our veterans, consequently increasing the strain on state resources.",
    "national_impacts": [
      "At the national level, the bill could jeopardize the healthcare of millions of Medicaid beneficiaries.",
      "Food security for SNAP households across the country may be severely compromised.",
      "The bill risks alienating our veterans, potentially depriving them of essential services."
    ],
    "talking_points": [
      "In Washington alone, over 1.14 million Medicaid beneficiaries may lose their healthcare coverage.",
      "The bill threatens the food security of 372,583 SNAP households in our state.",
      "The wellbeing of 509,863 Washington veterans stands at risk with the implementation of this bill."
    ],
    "social_post": "The #BigBeautifulBill may not be so beautiful for WA. It puts at risk 1.14M Medicaid beneficiaries, 372.5K SNAP households, and 509.8K veterans. Let's stand against policies that harm our citizens. #ProtectOurPeople"
  },
  {
    "state": "WI",
    "senators": [
      "Tammy Baldwin (D)",
      "Ron Johnson (R)"
    ],
    "summary": "The proposed bill would have major negative impacts in Wisconsin, putting the livelihoods of over 721,500 Medicaid recipients, 288,244 SNAP households, and 327,197 veterans at risk. These significant cuts would not only disrupt the lives of these individuals but also strain the state's resources and economy.",
    "national_impacts": [
      "Millions of Americans will lose access to vital healthcare services through Medicaid.",
      "The nation's most vulnerable households will face food insecurity with cuts to SNAP benefits.",
      "Our veterans, who have risked their lives for our country, will be left without necessary support."
    ],
    "talking_points": [
      "Over 721,500 Wisconsin residents who depend on Medicaid would be affected.",
      "Nearly 288,244 Wisconsin households who rely on SNAP benefits would face food insecurity.",
      "Our 327,197 Wisconsin veterans would be left without crucial aid."
    ],
    "social_post": "🚨ATTENTION WISCONSIN🚨 The proposed bill threatens over 721K Medicaid recipients, 288K SNAP households, and 327K veterans in our state! We can't afford these cuts. Contact Senator A and Senator B now and ask them to oppose the bill! #SaveOurServices"
  },
  {
    "state": "WV",
    "senators": [
      "Jim Justice (R)",
      "Shelley Moore Capito (R)"
    ],
    "summary": "The 'Big Beautiful Bill' poses significant threats to the residents of West Virginia. With 326,600 Medicaid recipients, 131,887 SNAP households, and 123,918 veterans at risk, the bill could result in substantial hardship and distress for our most vulnerable citizens. These potential outcomes indicate a dire need for careful reconsideration and amendment of the bill's provisions.",
    "national_impacts": [
      "Potential increase in the national poverty rate due to reduced access to public assistance.",
      "Heightened risk for veterans nationwide, jeopardizing the welfare of those who have served our country.",
      "Increased strain on local and state governments as federal support for essential programs like Medicaid and SNAP diminish."
    ],
    "talking_points": [
      "326,600 West Virginians on Medicaid stand to lose significant healthcare security.",
      "The bill puts food security at risk for 131,887 SNAP households in West Virginia.",
      "123,918 West Virginia veterans could face increased hardship and decreased support."
    ],
    "social_post": "The 'Big Beautiful Bill' isn't so beautiful for WV. It threatens the healthcare of 326,600 Medicaid recipients, the food security of 131,887 SNAP households, and the welfare of 123,918 of our brave veterans. We need #BetterBills for WV. Contact Senators A and B today!"
  },
  {
    "state": "AZ",
    "senators": [
      "Ruben Gallego (D)",
      "Mark Kelly (D)"
    ],
    "summary": "The proposed bill poses significant threats to Arizona, putting at risk essential benefits for hundreds of thousands of residents. With 901,500 individuals at risk of losing Medicaid, 252,314 households potentially losing SNAP benefits, and 429,242 veterans facing the loss of crucial support, the impact on the state's most vulnerable populations could be devastating.",
    "national_impacts": [
      "Millions of Americans could lose access to vital healthcare services.",
      "A significant increase in food insecurity as SNAP benefits are reduced nationwide.",
      "Veterans across the country risk losing critical support and services."
    ],
    "talking_points": [
      "Over 900,000 Arizonans could lose Medicaid, causing a healthcare crisis in our state.",
      "More than 250,000 Arizona households depend on SNAP to feed their families, and this bill threatens their food security.",
      "Our veterans, who have served our country, face losing essential benefits, affecting over 429,000 in Arizona alone."
    ],
    "social_post": "🚨 Arizona Alert: The new bill threatens to strip healthcare from 901,500, reduce SNAP benefits for 252,314 households, and harm 429,242 veterans in our state. We must stand up for our communities! #ProtectAZ #StandWithArizona"
  },
  {
    "state": "CO",
    "senators": [
      "Michael Bennet (D)",
      "John Hickenlooper (D)"
    ],
    "summary": "The proposed bill poses significant risks to Colorado, potentially jeopardizing essential services for vulnerable populations. With nearly 800,000 Medicaid beneficiaries, close to 200,000 SNAP households, and over 368,000 veterans at risk, the implications for public health, food security, and veteran support are profound.",
    "national_impacts": [
      "Millions of Americans could lose access to critical healthcare services.",
      "The bill threatens to cut food assistance for countless families nationwide.",
      "Veterans across the country may experience reduced support and services."
    ],
    "talking_points": [
      "Colorado could see nearly 800,000 Medicaid recipients losing their healthcare coverage.",
      "Almost 200,000 households in Colorado could be at risk of losing vital food assistance through SNAP.",
      "Over 368,000 veterans in Colorado might face diminished access to essential services and support."
    ],
    "social_post": "Urgent: Proposed legislation threatens to cut essential services for thousands in Colorado. Nearly 800k on Medicaid, 200k SNAP households, and 368k veterans at risk! #ProtectCO #StandWithCO"
  },
  {
    "state": "FL",
    "senators": [
      "Ashley Moody (R)",
      "Rick Scott (R)"
    ],
    "summary": "The proposed bill poses significant risks to Florida by threatening the well-being of over 2.6 million individuals reliant on Medicaid, jeopardizing food security for more than 1.2 million SNAP households, and endangering the benefits of over 1.4 million veterans. These cuts could severely impact the health, financial stability, and overall quality of life for millions of Floridians.",
    "national_impacts": [
      "Millions across the country could lose access to essential healthcare services due to Medicaid cuts.",
      "Reduced SNAP benefits nationwide may result in increased food insecurity for vulnerable families.",
      "Veterans across the U.S. could see reductions in benefits that are crucial for their well-being and stability."
    ],
    "talking_points": [
      "Over 2.6 million Floridians could lose their Medicaid coverage, resulting in a healthcare crisis.",
      "More than 1.2 million SNAP households in Florida face the threat of food insecurity with proposed benefit cuts.",
      "Florida's 1.4 million veterans stand to lose essential benefits that support their transition and integration into civilian life."
    ],
    "social_post": "The new bill threatens to strip healthcare from 2.6 million Floridians, cut food support for 1.2 million households, and reduce benefits for 1.4 million veterans. Senators Marco Rubio and Rick Scott, Floridians need you to stand up for them! #ProtectFL #StandUpForFlorida"
  },
  {
    "state": "GA",
    "senators": [
      "Jon Ossoff (D)",
      "Raphael Warnock (D)"
    ],
    "summary": "The proposed legislation threatens the well-being of Georgia's most vulnerable populations by putting at risk essential services such as Medicaid for 1,416,000 residents, SNAP benefits for 496,199 households, and support for 662,380 veterans. This could lead to increased hardship and economic instability across the state.",
    "national_impacts": [
      "Millions of Americans could lose access to critical healthcare services as Medicaid is scaled back.",
      "SNAP benefits reductions could increase food insecurity nationwide, affecting families and children the most.",
      "Veterans across the country may face reduced support services, impacting their health and well-being."
    ],
    "talking_points": [
      "Georgia could see over a million residents lose Medicaid coverage, impacting their access to healthcare.",
      "Nearly half a million Georgia households relying on SNAP benefits may struggle with food insecurity.",
      "The wellbeing of over 662,000 veterans in Georgia is at stake, as they could lose essential support services."
    ],
    "social_post": "The new bill puts 1.4 million Georgians' health and nearly 500k households' food security at risk. Our veterans deserve better. Stand with Senators Ossoff and Warnock to protect our community. #ProtectGA"
  },
  {
    "state": "LA",
    "senators": [
      "Bill Cassidy (R)",
      "John Kennedy (R)"
    ],
    "summary": "The proposed Big Beautiful Bill poses significant risks to Louisiana, with over a million residents potentially losing Medicaid coverage, nearly 340,000 households facing the loss of SNAP benefits, and more than a quarter of a million veterans at risk. These changes could severely impact the health and well-being of our communities, particularly the most vulnerable populations.",
    "national_impacts": [
      "Millions of Americans could lose access to essential healthcare services.",
      "A significant increase in food insecurity as SNAP benefits are reduced nationwide.",
      "Veterans across the country may face increased hardships due to reduced support."
    ],
    "talking_points": [
      "Over 1 million Louisianans could lose Medicaid, affecting access to essential health services.",
      "Nearly 340,000 households in Louisiana may struggle with food insecurity if SNAP benefits are cut.",
      "The state's 257,381 veterans could face heightened challenges due to reduced federal support."
    ],
    "social_post": "The Big Beautiful Bill threatens Louisiana's most vulnerable: over 1M could lose Medicaid, 339K households risk SNAP loss, and 257K veterans face uncertainty. We must stand up for our community. #ProtectLouisiana"
  },
  {
    "state": "MT",
    "senators": [
      "Tim Sheehy (R)",
      "Steve Daines (R)"
    ],
    "summary": "The proposed bill poses significant threats to Montana by jeopardizing essential services for its residents. With 175,600 individuals at risk of losing Medicaid, 38,805 households facing potential SNAP benefits cuts, and 88,542 veterans who could be affected, the bill could severely impair the health and well-being of many Montanans.",
    "national_impacts": [
      "Millions of Americans could lose access to essential healthcare services.",
      "The reduction in SNAP benefits may lead to increased food insecurity nationwide.",
      "Veterans across the country may face challenges in accessing needed support and services."
    ],
    "talking_points": [
      "Montana's economy relies heavily on the well-being of its residents; cuts to Medicaid will have ripple effects across the state.",
      "With nearly 39,000 Montana households relying on SNAP, this bill threatens to increase hunger and poverty levels.",
      "Our veterans have served our country valiantly; denying them support is not the way to honor their service."
    ],
    "social_post": "Montanans: The new bill puts 175,600 of us at risk of losing Medicaid, threatens 38,805 households' SNAP benefits, and impacts 88,542 veterans. Let's stand together to protect our community! #ProtectMT #SupportVeterans"
  },
  {
    "state": "NY",
    "senators": [
      "Chuck Schumer (D)",
      "Kirsten Gillibrand (D)"
    ],
    "summary": "The proposed bill poses significant risks to New York, threatening the well-being of nearly 4 million Medicaid recipients, over 1.1 million SNAP households, and more than 662,000 veterans. These cuts could lead to increased poverty, reduced access to healthcare, and heightened food insecurity across the state.",
    "national_impacts": [
      "Millions of Americans could lose access to essential healthcare services.",
      "Significant reductions in food assistance may increase hunger and poverty nationwide.",
      "Veterans across the country could face diminished support and resources."
    ],
    "talking_points": [
      "Over 3.8 million New Yorkers risk losing their Medicaid coverage, jeopardizing their access to critical healthcare services.",
      "More than 1.1 million households in New York could see cuts to their SNAP benefits, leading to increased food insecurity.",
      "The bill endangers the support systems for over 662,000 veterans in New York, undermining their well-being and stability."
    ],
    "social_post": "🚨 Urgent: A new bill threatens the health and stability of New Yorkers! Nearly 4 million could lose Medicaid, over 1.1 million face SNAP cuts, and 662,000 veterans are at risk. We must protect our communities! #ProtectNY #NoCuts"
  },
  {
    "state": "PA",
    "senators": [
      "Dave McCormick (R)",
      "John Fetterman (D)"
    ],
    "summary": "The Big Beautiful Bill poses significant threats to Pennsylvania by putting key support systems at risk. With over 1.8 million Medicaid recipients, 737,503 SNAP households, and 688,198 veterans potentially affected, this bill could severely undermine the health, food security, and well-being of many Pennsylvanians. The proposed changes could lead to increased hardship for the most vulnerable populations in the state.",
    "national_impacts": [
      "Millions of Americans could lose access to essential healthcare services.",
      "Food insecurity may rise due to reductions in SNAP benefits.",
      "Veterans' access to critical support services could be jeopardized."
    ],
    "talking_points": [
      "Over 1.8 million Pennsylvanians could lose Medicaid coverage, impacting their access to vital healthcare services.",
      "Nearly three-quarters of a million households in Pennsylvania could face increased food insecurity if SNAP benefits are reduced.",
      "The bill threatens the well-being of over 688,000 veterans in Pennsylvania who rely on crucial support services."
    ],
    "social_post": "The Big Beautiful Bill puts over 1.8 million Pennsylvanians' Medicaid coverage at risk, threatens food security for 737,503 households, and jeopardizes support for 688,198 veterans. We must protect our most vulnerable. #ProtectPA"
  },
  {
    "state": "SD",
    "senators": [
      "John Thune (R)",
      "Mike Rounds (R)"
    ],
    "summary": "The proposed bill poses significant risks to South Dakota by potentially disrupting crucial support systems. Around 85,000 individuals reliant on Medicaid could lose access to essential healthcare services. Additionally, 28,623 households depending on SNAP benefits may face food insecurity, and 65,335 veterans could see reductions in their benefits, affecting their quality of life.",
    "national_impacts": [
      "Millions of Americans could lose access to healthcare services due to cuts in Medicaid funding.",
      "The bill may increase food insecurity nationwide by reducing SNAP benefits for vulnerable families.",
      "Veterans across the country could face decreased support, impacting their healthcare and economic stability."
    ],
    "talking_points": [
      "In South Dakota, 85,000 people risk losing Medicaid coverage, jeopardizing their healthcare access.",
      "The bill threatens food security for 28,623 South Dakota households relying on SNAP benefits.",
      "South Dakota's 65,335 veterans could face cuts to their essential benefits, affecting their wellbeing."
    ],
    "social_post": "The Big Beautiful Bill threatens vital support for South Dakota: 85,000 could lose Medicaid, 28,623 families face food insecurity, and 65,335 veterans may see reduced benefits. We need to protect our communities! #ProtectSD"
  },
  {
    "state": "WY",
    "senators": [
      "John Barrasso (R)",
      "Cynthia Lummis (R)"
    ],
    "summary": "The proposed bill poses significant risks to Wyoming, potentially jeopardizing Medicaid coverage for 52,000 residents, reducing essential food assistance for 13,427 households reliant on SNAP, and affecting 47,220 veterans who depend on critical support services.",
    "national_impacts": [
      "Millions of low-income families across the country could lose access to essential health care services.",
      "National food insecurity rates may rise as SNAP benefits face significant cuts.",
      "Veterans nationwide could see reduced support for housing, healthcare, and employment services."
    ],
    "talking_points": [
      "Wyoming's healthcare infrastructure is at risk with 52,000 residents potentially losing Medicaid coverage.",
      "Cuts to SNAP could exacerbate food insecurity for over 13,000 households in our state.",
      "Our veterans, numbering over 47,000, may face diminished support services, impacting their well-being and integration into our communities."
    ],
    "social_post": "Wyoming stands to lose big with proposed cuts: 52,000 may lose Medicaid, 13,427 households face SNAP reductions, and 47,220 veterans could see vital support slashed. We must speak out to protect our communities! #ProtectWY"
  }
]